// Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 или Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка.

int enterCoordinate(string message)
    {
    System.Console.WriteLine(message);
    string value = Console.ReadLine();
    return int.Parse(value)
    }

boll 
int x =